//--------------------------------------------
// 汎用ユーティリティー
//--------------------------------------------
package jp.excd.meloco.utility;

public class CommonUtil {
    //----------------------------------------------------------------
    public static String TAG_FOR_LOG = "アプリ出力ログ";
    //----------------------------------------------------------------
    // ログ出力用のタグ取得
    //   インスタンスメソッドの場合
    //----------------------------------------------------------------
    public static String tag(Object o) {
        String s = TAG_FOR_LOG + " " + o.getClass().getSimpleName();
        return s;
    }
    //----------------------------------------------------------------
    // ログ出力用のタグ取得
    //   スタティックメソッドの場合
    //----------------------------------------------------------------
    public static String tag() {
        return TAG_FOR_LOG;
    }

}
